routes/web.php

select count(*) as "aggregate" from "cobrancas" where "cobrancas"."cliente_id" = '892d7c3c-294f-4734-9788-07d853e265fc' and "cobrancas"."cliente_id" is not null and "cobrancas"."deleted_at" is null
select * from "clientes" where "clientes"."deleted_at" is null limit 20
select * from "cobrancas" where "cobrancas"."cliente_id" in ('892d7c3c-294f-4734-9788-07d853e265fc') and "cobrancas"."deleted_at" is null
---
        return response()->json(['users' => $users, 'count' => $count[0]->c ?? 0]);
    });

    Route::get('/__debug_n_plus_one', function () {
        // simulate N+1: fetch clientes and for each load cobrancas count (without eager loading)
        $clientes = App\Models\Cliente::limit(20)->get();
        $counts = [];
        foreach ($clientes as $c) {
            $counts[] = $c->cobrancas()->count();
        }
        return response()->json(['clientes' => $clientes->pluck('id'), 'counts_sample' => array_slice($counts,0,5)]);
    });

    Route::get('/__debug_n_plus_one_eager', function () {
        // same but with eager loading
        $clientes = App\Models\Cliente::with('cobrancas')->limit(20)->get();